import { Db, ObjectId } from "mongodb";
import { BaseSeeder } from "./baseSeeder";
import { DataSeeder } from "./dataSeeder";
import { UnitEntity } from "../entities/unitEntity";
import { EnvConfig } from "../../config/environment";
import { seedingConstants } from "./seedingConstants";

export class UnitsSeeder extends BaseSeeder implements DataSeeder {
    constructor(private envConfig: EnvConfig) {
        super();
    }

    async Seed(db: Db): Promise<void> {
        var unitsCollection = db.collection(this.envConfig.dbUnitsCollection);

        await this.SeedEntities(unitsCollection);
    }

    async getSeedData(): Promise<any[]> {
        var data: UnitEntity[] = [
            {
                _id: new ObjectId(seedingConstants.units.gur),
                name: "Головне управління розвідки",
                description: `MІСІЯ
Наша місія — оберігати країну. Ми — перші, хто виявляє загрози та надає ключову розвідувальну інформацію для захисту держави.
Для нас Україна — на першому місці, і ми боремося проти будь-яких викликів, які можуть стати на шляху її світлого майбутнього.

ЗАВДАННЯ
Ми захищаємо національні інтереси України, протидіємо загрозам національній безпеці, надаємо розвідувальну інформацію керівництву держави та Сил безпеки й оборони України.

ЦІННОСТІ
Ми керуємося принципами братерства, сміливості та професіоналізму.
Ми діємо чесно, дотримуючись принципів справедливості. Мужньо виконуємо складні та небезпечні завдання. Наша діяльність ґрунтується на лідерстві, згуртованості та вмотивованості, які є основою нашої результативності.

ЩО МИ РОБИМО

Розвідувальні органи України:
- здійснюють добування, аналітичне опрацювання, оброблення і надання розвідувальної інформації її споживачам у встановленому Законом України “Про розвідку” порядку;
- проводять заходи з метою сприяння реалізації національних інтересів України, забезпечення безпеки та участі у формуванні та реалізації державної політики у визначених законом сферах, посилення обороноздатності держави, економічного та науково-технічного розвитку;
- виявляють і визначають ступінь зовнішніх загроз національній безпеці України, у тому числі у кіберпросторі, життю, здоров’ю її громадян та об’єктам державної власності за межами України, організовують і проводять спеціальні (активні) заходи щодо таких загроз і з протидії іншій діяльності, що становить зовнішню загрозу національній безпеці України;
- беруть участь у боротьбі з тероризмом, протидії розвідувально-підривній діяльності проти України, транснаціональній організованій злочинності та іншій злочинній діяльності, що становлять зовнішню загрозу національній безпеці України;
- здійснюють співробітництво з компетентними органами іноземних держав, міжнародними організаціями;
- здійснюють інші визначені законом функції з метою забезпечення національної безпеки України.

Основними завданнями розвідки є:
- своєчасне забезпечення споживачів розвідувальною інформацією;
- сприяння реалізації національних інтересів України;
- протидія зовнішнім загрозам національній безпеці України у визначених законом сферах.

Головне управління розвідки Міністерства оборони України здійснює розвідувальну діяльність у воєнній сфері, сферах оборони, військового будівництва, військово-технічній та кібербезпеки.

ГУР МО України є головним органом управління в системі воєнної розвідки і в межах повноважень у визначеному Законом України “Про розвідку” та актами Президента України порядку  координує діяльність суб’єктів воєнної розвідки та залучає інші визначені суб’єкти, а в особливий період – інші складові сил оборони до виконання покладених на розвідувальний орган завдань.

Розвідувальний орган Міністерства оборони України у межах компетенції також може залучати до виконання розвідувальних завдань інших суб’єктів розвідувального співтовариства.`,
                foundationDate: new Date(1992, 9, 7),
                imageUrl: "https://scontent-waw2-2.xx.fbcdn.net/v/t39.30808-6/411746262_677692874542136_6277054686580970176_n.png?stp=dst-png_p720x720&_nc_cat=107&ccb=1-7&_nc_sid=cc71e4&_nc_ohc=aju6D2sRzUMQ7kNvgH2DD-i&_nc_zt=23&_nc_ht=scontent-waw2-2.xx&_nc_gid=AUAd7P7zJDszHwVTdqLO6KN&oh=00_AYAzDI5YC-P811NEKbivHtru52z5cuI0UPn9zPrj1K7y8w&oe=67849B8E"
            },
            {
                _id: new ObjectId(seedingConstants.units.azov),
                name: "АЗОВ",
                description: `12-та бригада спеціального призначення «Азов» — професійне військове формування в складі Національної гвардії України, засноване 5 травня 2014 року. З першого дня свого існування «Азов» забезпечує захист територіальної цілісності держави, її законів та конституційного ладу, активно бере участь у відбитті російської агресії на території України.
Фундаментальні цінності 12-ої бригади «Азов»: захист держави Україна, її незалежності та безпеки її громадян, патріотизм і відданість державі, людська гідність.`,
                foundationDate: new Date(2014, 5, 5),
                imageUrl: "https://pik.net.ua/wp-content/uploads/2024/10/462228690_1063990435728218_8531819207706704481_n-1-scaled11-scaled.jpg"
            },
            {
                _id: new ObjectId(seedingConstants.units.daVinciWolfs),
                name: "Вовки Да Вінчі",
                description: `Батальйон «Вовки Да Вінчі» (108-й окремий механізований батальйон) — батальйон Сил безпілотних систем Збройних сил України, який входить до складу 59-ї окремої штурмової бригади імені Якова Гандзюка. Командиром батальйону є капітан Сергій Філімонов.

108 окремий механізований батальйон 59 ОШБр утворено на основі «Вовків Да Вінчі», які в лютому 2024 року вийшли зі складу 1-го окремого штурмового батальйону 67 ОМБр.`,
                foundationDate: new Date(2022, 4, 8),
                imageUrl: "https://scontent-waw2-2.xx.fbcdn.net/v/t39.30808-6/358357536_648204767357184_4535080849947393637_n.png?stp=dst-png_p720x720&_nc_cat=102&ccb=1-7&_nc_sid=cc71e4&_nc_ohc=IG5MXwp3pocQ7kNvgHJ87WN&_nc_zt=23&_nc_ht=scontent-waw2-2.xx&_nc_gid=A1aA0neEeAEngiAZgMp9dcD&oh=00_AYDazkr8FjfTL6mqiMXAntEETosynoz1DLc0j2RLVZxbuA&oe=6784FD62"
            }
        ]

        return data;
    }
}